%求重心 遍历求解A B H 的值 Z = Ax^2+ By^2
clear
clc

%   M 船体质量
%   center_gravity 船体重心
Density = 0.1458; 

A =21.1;
B = 3.2;
H = 0.12;
M =1.0893;
center_gravity =0.0707;
boat.Moment = zeros(1,50,'double');


for Angle = 91:1:180
    disp(Angle);
    Y_MAX = sqrt(H./B);
    X_MAX = sqrt(H./A);
% %-----135求吃水线的c---------------------------------------------------------------------------------------------
c = find_135_waterline(A,B,H,X_MAX,M,Angle);
%%-------135吃水线---end----------------------------------------------------------------------------------------
% if c==-10        %如果没求出吃水线的c就循环下一次
%     disp(['跳135吃水线']);
%     continue;
% end
%------浮心------------------------------------------------------------------------------------------------------------------
    COB = find_COB(A,B,H,X_MAX,c,Angle);
%------重心----------------------------------------------------------------------------------------------------------------------
    COM = [0 0 center_gravity];
%-------复原力矩---------------------------------------------------------------------------------------------------------------------
    P = (Angle-270)./180.*pi;
    g = 9.8;
    F = [g.*M.*cos(P) 0 g.*M.*sin(P)];                            %力部分初始化
    Moment = cross(COB - COM,F);
    boat.Moment(Angle-90) = Moment(2);
%---------------------------------------------------------------------------------------------------------------------------
end
%---写入excel--------------------------------------------------------------------------------
% Varname= {'A','B','H','重物重心','船体重心','质量','吃水线c','复原力矩'};
% T = table(boat.A',boat.B',boat.H',boat.c_weight',boat.center_gravity',boat.M',boat.c',boat.Moment','VariableNames',Varname);
title('小船倾斜角度与复原力矩的关系图');
xlabel('倾斜角度 ');
ylabel('复原力矩');
hold on
plot((91:180),boat.Moment);
grid on
% writetable(T,'temp.xlsx');
% type 'temp.xlsx'
% %---------------------------------------------------------------------------------------------------
% disp(boat);